---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.Insert(Autodesk.Revit.DB.PlanTopology)
source: html/fe4a9017-9baa-3096-f7af-222ec7e2a510.htm
---
# Autodesk.Revit.DB.PlanTopologySet.Insert Method

Insert the specified item into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	PlanTopology item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanTopology`) - The item to be inserted into the set.

## Returns
Returns whether the item was inserted into the set.